In [120]:
import pandas as pd
import numpy as py
import matplotlib.pyplot as plt
import seaborn as sns
import warnings 
warnings.filterwarnings('ignore')
from statistics import mean,median,mode,stdev,variance

In [110]:
dataset = pd.read_csv("StudentsPerformance.csv")

In [111]:
dataset

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33
...,...,...,...,...,...,...,...,...
995,male,group E,some college,standard,completed,99,87,81
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
998,male,group E,associate's degree,free/reduced,completed,100,100,93
999,male,group E,bachelor's degree,standard,completed,100,100,100

# 1. Find out how many males and females participated in the test

In [112]:
dataset['gender'].value_counts()

female    518
male      482
Name: gender, dtype: int64

# 2. About students' parental level of education

In [90]:
dataset['parental level of education'].mode()

0    some college
dtype: object

In [91]:
# While examining the resultant output, we can say that most of the student's parental level of education is done from 'some colleges'.

# 3. Students who scores the most on average for math, reading and writing based on:

# a.Gender

In [126]:
avg_scores=dataset.groupby('gender')['math score','reading score','writing score'].mean()
avg_scores

        math score  reading score  writing score
gender
female   63.376448      72.590734      72.467181
male     68.821577      65.545643      63.446058

In [ ]:
# Here the gender which scored most on average in 
# *math score = 'male'
# *reading score = 'female'
# *writing score = 'female'

# b.Test preparation course

In [121]:
avg_scores=dataset.groupby('test preparation course')['math score','reading score','writing score'].mean()
avg_scores

                         math score  reading score  writing score
test preparation course
completed                  69.96648      74.175978      74.684358
none                       63.78972      66.417445      64.457944

In [94]:
#Here the students which scored most on average in math score,reading score & writing score are the one who have completed the test preparation course

# 4. Scoring variation for math, reading and writing based on:

# a.Gender

In [122]:
var_scores=dataset.groupby('gender')['math score','reading score','writing score'].var()
var_scores

        math score  reading score  writing score
gender
female  256.958593     207.677438     220.369327
male    211.889097     200.211010     202.413924

In [ ]:
# Here female students have more variance than male ones in scoring variation for math,reading and writing.
# Higher the variance lower the consistency, Thus the perfomance of female students is lower than male students.

# b.Test preparation course

In [123]:
var_scores=dataset.groupby('test preparation course')['math score','reading score','writing score'].var()
var_scores

                         math score  reading score  writing score
test preparation course
completed                210.884027     183.265864     175.202612
none                     246.668662     213.419851     226.251739

In [124]:
# Here the students who completed the test preparation have more in scoring variation for math,reading and writing.
# Higher the variance lower the consistency, Thus the perfomance of non test preparation course completed is lower than the completed ones.

# 5. Top 25% ofStudents who scored highest marks in maths score

In [125]:
dataset.nlargest(250,'math score')

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
515,female,group E,some college,standard,none,100,92,97
516,female,group E,bachelor's degree,standard,none,100,100,100
517,female,group E,associate's degree,standard,none,100,100,100
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
...,...,...,...,...,...,...,...,...
428,female,group D,some college,free/reduced,none,77,86,86
429,female,group E,some high school,standard,none,77,79,80
849,male,group A,bachelor's degree,standard,none,77,67,68
850,male,group C,associate's degree,free/reduced,none,77,67,64
851,male,group D,some college,standard,completed,77,62,62

In [ ]:
# Here 25% of total 1000 students means 250 students.